// 111 შექმენი ფუნქცია რომელიც არგუმენტად იღებს სტრინგს, შენი დავალებაა for-ით გადაუყვე მას ხმოვნები 
// "aeiou" იგრეკი "y" არ ითვლება, ამოიღო ამ სტრინგიდან და მხოლოდ თანხმოვნიანი სტრინგი დააბრუნო. 
// სტრინგის მაგალითი: str1 = "the world without programming"

// let str1 = "the world without programming"
// function func(str){
//     let equal = ""
//     for(let i =0; i< str.length; i++){
//         if(!"aeiou".includes(str[i])){
//          equal = equal + str[i]
//         }
//     }
//     return equal
// }
// console.log(func(str1))


// 222 შექმენი ფუნქცია რომელსაც არგუმენტად გადაეცემა მასივი ამ ფუნქციამ 
// უნდა მოაშოროს ყველა ის ელემენტი რომელიც კენტია, ანუ დატოვოს მხოლოდ ლუწები და ასევე მოშორებული კენტების ადგილას ჩაამატოს მათი ინდექსები.
//  მესამე classwork-ის მსგავსია. მასივის მაგალითი: arr = [12, 5, 78, 99, 9, 54, 29, 20]

    // arr1 = [12, 5, 78, 99, 9, 54, 29, 20]
    // function func2(arr){
    //     let theArr = []
    //     for(let i =0; i<arr.length;i++){
    //         if(arr[i] %2 !=0){
    //             theArr.push(i)
    //     }else{
    //         theArr.push(arr[i])
    //     }
    // } return theArr
    // }

// 333 შექმენი ფუნქცია რომელსაც გადაეცემა ორი არგუმენტი, პირველი არგუმენტი არის რიცხვი ხოლო მეორე არგუმენტი მასივი შენი დავალებაა დათვალო
// თუ მოცემული რიცხვი რამდენ რიცხვზე მეტია ამ მასივიდან. (გამოიყენე მასივი მეორე დავალებიდან). რიცხვის მაგალითი num = 48

// let num=48
// let arr = [12, 5, 78, 99, 9, 54, 29, 20]
// function func(num,arr){
//    let count = 0
//     for(let i =0 ; i <arr.length; i++){
//         if(num> arr[i]){
//             count++
//         }
//         
//     }return count
// }

// 444 შექმენი ფუნქცია რომელსაც გადაეცემა ორი არგუმენტი, პირველი არგუმენტი არის რიცხვი ხოლო მეორე არგუმენტი 
// მასივი შენი დავალებაა ახალ მასივში შეიტანო true და false იმის მიხედვით თუ რომელ რიცხვზე მეტი იქნება ეს რიცხვი.
//  რიცხვის მაგალითი აიღე მესამე დავალებიდან მასივი მეორედან.

// let num=48
// let arr = [12, 5, 78, 99, 9, 54, 29, 20]
// function func1(num,arr){
//     let equal = []
//     for(let i = 0; i < arr.length; i++){
//         if(num > arr[i]){
//             equal.push(true)
//         }else{
//             equal.push(false)
//         }
//     } return equal
// }



// 555 შექმენი ფუნქცია რომელსაც გადაეცემა 2 არგუმენტი, პირველი არგუმენტში გადმოგეცემა რიცხვი ხოლო მეორეში სტრინგი, შენი დავალებაა მოცემული 
// რიცხვის მიხედვით  გადაუყვე სტრინგს და სტრინგში ჩაამატო მძიმე (,).  ! გათვალისწინე რომ რიცხვი არ იქნება სტრინგის სიგრძეზე მეტი. სტრინგი
// //  გამოიყენე პირველი დავალებიდან და რიცხვი იყოს 7

// let num1 = 7
// let str1 = "the world without programming"

// function func1(num, str1){
// let equal = ""
// for(let i =0; i< num ; i++){
//     equal += ","
// } return equal
// }


// 666 შექმენი ფუნქცია რომელსაც გადაეცემა 2 არგუმენტი, პირველი არგუმენტი არის სიტყვა ხოლო მეორე არგუმენტი სიტყვების მასივი შენი დავალებაა
//  ამ მასივში რომელი ელემენტიც არ უდრის ამ სიტყვას მის ადგილზე ჩაამატო ეს სიტყვა ხოლო რომელიც უდრის ამ სიტყვას მის ადგილას ჩაამატო 
//  ამ სიტყვის საპირისპირო სიტყვა. სტრინგის მაგალითი: str = "easy", მასივის მაგალითი arr = ["this", "place", "no", "easy", "more", "easy", "easy"]

// let str1 = "easy"
// let arr = ["this", "place", "no", "easy", "more", "easy", "easy"]
// function func1(str,arr){
//     let equal =[]
//     for (let i =0; i<arr.length; i++){
//         if(str == arr[i]){
//             equal.push("hard")
//         }else{
//             equal.push(str)
//         }
//     } return equal
// }